{
  "en": {
    "aboutTitle": "About Me - Haichuan Yu's Personal Website",
    "aboutDescription": "I am Haichuan Yu, a mechanical engineer from Qingdao, China, passionate about technology and innovation. Currently residing in Böblingen, Germany, I work at Bertrandt AG, primarily involved in the development and testing of automotive electronic control units and the R&D of prototype vehicles for OEMs. I love technological innovation and enjoy solving practical problems through programming and data analysis.",
    "aboutExperience": "Below is my personal education, life, and work experience:",
    "qingdao": "Qingdao",
    "germany": "Germany",
    "HighEducation": "Higher Education",
    "GuangzhouSCUT": "Guangzhou, China - South China University of Technology - Bachelor of Mechanical Engineering",
    "KarlsruheKIT": "Karlsruhe, Germany - Karlsruhe Institute of Technology - Bachelor and Master of Mechanical Engineering",
    "skills": "Skills and Expertise",
    "skill1": "Principles and Applications of Vibration",
    "skill2": "Mechanical Design and Simulation",
    "skill3": "Testing and Development of Automotive Electronic Control Units",
    "skill4": "German and Chinese driver's licenses, with over 100,000 kilometers of driving experience",
    "skill5": "Proficient in Chinese, English, and German",
    "skill6": "Programming Languages: MATLAB, Python, CANoe, DTS Monaco, JavaScript",
    "skillsMatrixDescription": "Below is my skills matrix, where three checkmarks indicate proficiency and one checkmark indicates basic understanding and ability to perform some fundamental operations:",
    "interests": "Interests and Hobbies",
    "interestsDescription": "I enjoy island travel, playing Go against computers, watching action and sci-fi movies, programming with AI, listening to Chinese pop music, and exploring new technologies."
  },
  "de": {
    "aboutTitle": "Über mich - Haichuan Yus persönliche Website",
    "aboutDescription": "Ich bin Haichuan Yu, ein Maschinenbauingenieur aus Qingdao, China, der sich für Technologie und Innovation begeistert. Derzeit wohne ich in Böblingen, Deutschland, und arbeite bei Bertrandt AG, hauptsächlich an der Entwicklung und Prüfung von elektronischen Steuergeräten für Fahrzeuge sowie an der Forschung und Entwicklung von Prototypenfahrzeugen für OEMs. Ich liebe technologische Innovationen und löse gerne praktische Probleme durch Programmierung und Datenanalyse.",
    "aboutExperience": "Hier sind meine persönlichen Bildungs-, Lebens- und Berufserfahrungen:",
    "qingdao": "Qingdao",
    "germany": "Deutschland",
    "HighEducation": "Hochschulbildung",
    "GuangzhouSCUT": "Guangzhou, China - Südchinesische Technische Universität - Bachelor Maschinenbau",
    "KarlsruheKIT": "Karlsruhe, Deutschland - Karlsruher Institut für Technologie - Bachelor und Master Maschinenbau",
    "skills": "Fähigkeiten und Expertise",
    "skill1": "Prinzipien und Anwendungen der Schwingungslehre",
    "skill2": "Maschinelles Design und Simulation",
    "skill3": "Prüfung und Entwicklung von elektronischen Steuergeräten für Fahrzeuge",
    "skill4": "Deutscher und chinesischer Führerschein, mit über 100.000 Kilometern Fahrerfahrung",
    "skill5": "Fließend in Chinesisch, Englisch und Deutsch",
    "skill6": "Programmiersprachen: MATLAB, Python, CANoe, DTS Monaco, JavaScript",
    "skillsMatrixDescription": "Hier ist meine Fähigkeitsmatrix, wobei drei Häkchen für fortgeschrittene Kenntnisse und ein Häkchen für grundlegendes Verständnis und die Fähigkeit zur Durchführung einiger grundlegender Operationen stehen:",
    "interests": "Interessen und Hobbys",
    "interestsDescription": "Ich genieße Inselreisen, spiele Go gegen Computer, schaue Action- und Science-Fiction-Filme, programmiere mit KI, höre chinesische Popmusik und erkunde neue Technologien."
  },
  "zh": {
    "aboutTitle": "关于我 - 余海川的个人网站",
    "aboutDescription": "我是余海川，一名来自中国青岛，热爱技术和创新的机械工程师，目前居住在德国伯布林根，在Bertrandt AG工作，主要从事汽车电子控制单元的开发测试以及主机厂原型车辆的研发相关工作。我热爱技术创新，喜欢通过编程和数据分析解决实际问题。",
    "aboutExperience": "以下是我的个人教育，生活及工作经历:",
    "qingdao": "青岛",
    "germany": "德国",
    "HighEducation": "高等教育经历",
    "GuangzhouSCUT": "中国广州 - 华南理工大学 - 机械工程学士",
    "KarlsruheKIT": "德国卡尔斯鲁厄 - 卡尔斯鲁厄理工学院 - 机械工程学士及硕士",
    "skills": "技能与专长",
    "skill1": "震荡学原理与应用",
    "skill2": "机械设计与仿真",
    "skill3": "汽车电子控制单元测试与开发",
    "skill4": "德国及中国驾照，驾驶里程累计超过10万公里",
    "skill5": "熟练掌握并应用中文英文德语三种语言",
    "skill6": "编程语言：MATLAB, Python, CANoe，DTS Monaco，JavaScript",
    "skillsMatrixDescription": "以下是我的能力矩阵，三个对号为熟练掌握及应用，一个对号为了解基本原理并可以进行一些基础操作：",
    "interests": "兴趣与爱好",
    "interestsDescription": "我喜欢海岛旅行，与电脑对弈，欣赏动作科幻电影，利用AI编程，听华语流行音乐，热衷于探索新技术。"
  }
}